cases/subsonic/Zhang/We8500/b_6Dinj/setup/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

// Wu_case_dev_RR — coarsened mesh (~1.30M cells, ~2.1x coarser than Wu_case_dev)
// BL preserved: z near-wall (58 cells, grading 165, Dz1~4um) and z-mid (18 cells) unchanged
// Coarsening: x and y reduced x0.75; z-far reduced 63->40
//
// x: B0 16->12 | B1a/b 60->45 | B2 80->60
// y: outer 24->18 | core 48->36
// z: near-wall 58 (unchanged) | mid 18 (unchanged) | far 63->40

scale 1;

vertices
(
    (-0.0040 -0.0160  0.0000)   // 0
    ( 0.0000 -0.0160  0.0000)   // 1
    ( 0.0150 -0.0160  0.0000)   // 2
    ( 0.0300 -0.0160  0.0000)   // 3
    ( 0.0800 -0.0160  0.0000)   // 4
    (-0.0040 -0.0048  0.0000)   // 5
    ( 0.0000 -0.0048  0.0000)   // 6
    ( 0.0150 -0.0048  0.0000)   // 7
    ( 0.0300 -0.0048  0.0000)   // 8
    ( 0.0800 -0.0048  0.0000)   // 9
    (-0.0040  0.0048  0.0000)   // 10
    ( 0.0000  0.0048  0.0000)   // 11
    ( 0.0150  0.0048  0.0000)   // 12
    ( 0.0300  0.0048  0.0000)   // 13
    ( 0.0800  0.0048  0.0000)   // 14
    (-0.0040  0.0160  0.0000)   // 15
    ( 0.0000  0.0160  0.0000)   // 16
    ( 0.0150  0.0160  0.0000)   // 17
    ( 0.0300  0.0160  0.0000)   // 18
    ( 0.0800  0.0160  0.0000)   // 19
    (-0.0040 -0.0160  0.0080)   // 20
    ( 0.0000 -0.0160  0.0080)   // 21
    ( 0.0150 -0.0160  0.0080)   // 22
    ( 0.0300 -0.0160  0.0080)   // 23
    ( 0.0800 -0.0160  0.0080)   // 24
    (-0.0040 -0.0048  0.0080)   // 25
    ( 0.0000 -0.0048  0.0080)   // 26
    ( 0.0150 -0.0048  0.0080)   // 27
    ( 0.0300 -0.0048  0.0080)   // 28
    ( 0.0800 -0.0048  0.0080)   // 29
    (-0.0040  0.0048  0.0080)   // 30
    ( 0.0000  0.0048  0.0080)   // 31
    ( 0.0150  0.0048  0.0080)   // 32
    ( 0.0300  0.0048  0.0080)   // 33
    ( 0.0800  0.0048  0.0080)   // 34
    (-0.0040  0.0160  0.0080)   // 35
    ( 0.0000  0.0160  0.0080)   // 36
    ( 0.0150  0.0160  0.0080)   // 37
    ( 0.0300  0.0160  0.0080)   // 38
    ( 0.0800  0.0160  0.0080)   // 39
    ( 0.0000 -0.0160  0.0160)   // 40
    ( 0.0150 -0.0160  0.0160)   // 41
    ( 0.0300 -0.0160  0.0160)   // 42
    ( 0.0800 -0.0160  0.0160)   // 43
    ( 0.0000 -0.0048  0.0160)   // 44
    ( 0.0150 -0.0048  0.0160)   // 45
    ( 0.0300 -0.0048  0.0160)   // 46
    ( 0.0800 -0.0048  0.0160)   // 47
    ( 0.0000  0.0048  0.0160)   // 48
    ( 0.0150  0.0048  0.0160)   // 49
    ( 0.0300  0.0048  0.0160)   // 50
    ( 0.0800  0.0048  0.0160)   // 51
    ( 0.0000  0.0160  0.0160)   // 52
    ( 0.0150  0.0160  0.0160)   // 53
    ( 0.0300  0.0160  0.0160)   // 54
    ( 0.0800  0.0160  0.0160)   // 55
    ( 0.0000 -0.0160  0.0650)   // 56
    ( 0.0150 -0.0160  0.0650)   // 57
    ( 0.0300 -0.0160  0.0650)   // 58
    ( 0.0800 -0.0160  0.0650)   // 59
    ( 0.0000 -0.0048  0.0650)   // 60
    ( 0.0150 -0.0048  0.0650)   // 61
    ( 0.0300 -0.0048  0.0650)   // 62
    ( 0.0800 -0.0048  0.0650)   // 63
    ( 0.0000  0.0048  0.0650)   // 64
    ( 0.0150  0.0048  0.0650)   // 65
    ( 0.0300  0.0048  0.0650)   // 66
    ( 0.0800  0.0048  0.0650)   // 67
    ( 0.0000  0.0160  0.0650)   // 68
    ( 0.0150  0.0160  0.0650)   // 69
    ( 0.0300  0.0160  0.0650)   // 70
    ( 0.0800  0.0160  0.0650)   // 71
);

blocks
(
    // B0_y0
    hex (0 1 6 5 20 21 26 25) (12 18 58) simpleGrading (1 1 165)
    // B1a_y0
    hex (1 2 7 6 21 22 27 26) (45 18 58) simpleGrading (1 1 165)
    // B1b_y0
    hex (2 3 8 7 22 23 28 27) (45 18 58) simpleGrading (1 1 165)
    // B2_y0
    hex (3 4 9 8 23 24 29 28) (60 18 58) simpleGrading (4 1 165)
    // B0_y1
    hex (5 6 11 10 25 26 31 30) (12 36 58) simpleGrading (1 1 165)
    // B1a_y1
    hex (6 7 12 11 26 27 32 31) (45 36 58) simpleGrading (1 1 165)
    // B1b_y1
    hex (7 8 13 12 27 28 33 32) (45 36 58) simpleGrading (1 1 165)
    // B2_y1
    hex (8 9 14 13 28 29 34 33) (60 36 58) simpleGrading (4 1 165)
    // B0_y2
    hex (10 11 16 15 30 31 36 35) (12 18 58) simpleGrading (1 1 165)
    // B1a_y2
    hex (11 12 17 16 31 32 37 36) (45 18 58) simpleGrading (1 1 165)
    // B1b_y2
    hex (12 13 18 17 32 33 38 37) (45 18 58) simpleGrading (1 1 165)
    // B2_y2
    hex (13 14 19 18 33 34 39 38) (60 18 58) simpleGrading (4 1 165)
    // B3a_lo_y0
    hex (21 22 27 26 40 41 45 44) (45 18 18) simpleGrading (1 1 0.404)
    // B3b_lo_y0
    hex (22 23 28 27 41 42 46 45) (45 18 18) simpleGrading (1 1 0.404)
    // B4_lo_y0
    hex (23 24 29 28 42 43 47 46) (60 18 18) simpleGrading (4 1 0.404)
    // B3a_lo_y1
    hex (26 27 32 31 44 45 49 48) (45 36 18) simpleGrading (1 1 0.404)
    // B3b_lo_y1
    hex (27 28 33 32 45 46 50 49) (45 36 18) simpleGrading (1 1 0.404)
    // B4_lo_y1
    hex (28 29 34 33 46 47 51 50) (60 36 18) simpleGrading (4 1 0.404)
    // B3a_lo_y2
    hex (31 32 37 36 48 49 53 52) (45 18 18) simpleGrading (1 1 0.404)
    // B3b_lo_y2
    hex (32 33 38 37 49 50 54 53) (45 18 18) simpleGrading (1 1 0.404)
    // B4_lo_y2
    hex (33 34 39 38 50 51 55 54) (60 18 18) simpleGrading (4 1 0.404)
    // B3a_up_y0
    hex (40 41 45 44 56 57 61 60) (45 18 40) simpleGrading (1 1 2)
    // B3b_up_y0
    hex (41 42 46 45 57 58 62 61) (45 18 40) simpleGrading (1 1 2)
    // B4_up_y0
    hex (42 43 47 46 58 59 63 62) (60 18 40) simpleGrading (4 1 2)
    // B3a_up_y1
    hex (44 45 49 48 60 61 65 64) (45 36 40) simpleGrading (1 1 2)
    // B3b_up_y1
    hex (45 46 50 49 61 62 66 65) (45 36 40) simpleGrading (1 1 2)
    // B4_up_y1
    hex (46 47 51 50 62 63 67 66) (60 36 40) simpleGrading (4 1 2)
    // B3a_up_y2
    hex (48 49 53 52 64 65 69 68) (45 18 40) simpleGrading (1 1 2)
    // B3b_up_y2
    hex (49 50 54 53 65 66 70 69) (45 18 40) simpleGrading (1 1 2)
    // B4_up_y2
    hex (50 51 55 54 66 67 71 70) (60 18 40) simpleGrading (4 1 2)
);

edges ();

patches
(
    patch gasInlet
    (
        (0 5 25 20)
        (5 10 30 25)
        (10 15 35 30)
    )

    patch outletRight
    (
        (4 9 29 24)
        (24 29 47 43)
        (43 47 63 59)
        (9 14 34 29)
        (29 34 51 47)
        (47 51 67 63)
        (14 19 39 34)
        (34 39 55 51)
        (51 55 71 67)
    )

    patch outletTop
    (
        (56 57 61 60)
        (57 58 62 61)
        (58 59 63 62)
        (60 61 65 64)
        (61 62 66 65)
        (62 63 67 66)
        (64 65 69 68)
        (65 66 70 69)
        (66 67 71 70)
    )

    wall bottomWall
    (
        (0 1 6 5)
        (1 2 7 6)
        (2 3 8 7)
        (3 4 9 8)
        (5 6 11 10)
        (6 7 12 11)
        (7 8 13 12)
        (8 9 14 13)
        (10 11 16 15)
        (11 12 17 16)
        (12 13 18 17)
        (13 14 19 18)
    )

    wall filmTopWall
    (
        (20 21 26 25)
        (25 26 31 30)
        (30 31 36 35)
    )

    wall stepWall
    (
        (21 26 44 40)
        (40 44 60 56)
        (26 31 48 44)
        (44 48 64 60)
        (31 36 52 48)
        (48 52 68 64)
    )

    symmetryPlane front
    (
        (0 1 21 20)
        (1 2 22 21)
        (2 3 23 22)
        (3 4 24 23)
        (21 22 41 40)
        (22 23 42 41)
        (23 24 43 42)
        (40 41 57 56)
        (41 42 58 57)
        (42 43 59 58)
    )

    symmetryPlane back
    (
        (15 35 36 16)
        (16 36 37 17)
        (17 37 38 18)
        (18 38 39 19)
        (36 52 53 37)
        (37 53 54 38)
        (38 54 55 39)
        (52 68 69 53)
        (53 69 70 54)
        (54 70 71 55)
    )

);

mergePatchPairs ();

// ************************************************************************* //
