cases/subsonic/Zhang/We8500/b_6Dinj/setup/constant/smoothingProperties
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      smoothingProperties;
}

smoothBandwidth   0.0096;   // 6 x Dinj = 6 x 1.6mm
